#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azuread_group.k8s_administrators: Refreshing state... [id=f453d3b2-44fe-4359-83cc-1328bcf53d27]
azurerm_resource_group.k8s_rg: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourceGroups/demo-k8s-rg]
azurerm_log_analytics_workspace.k8s_monitor: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/microsoft.operationalinsights/workspaces/demo-k8s-monitor]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.k8s_cluster will be created
  + resource "azurerm_kubernetes_cluster" "k8s_cluster" {
      + dns_prefix              = "demo-k8s"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + kube_admin_config       = (known after apply)
      + kube_admin_config_raw   = (sensitive value)
      + kube_config             = (known after apply)
      + kube_config_raw         = (sensitive value)
      + kubelet_identity        = (known after apply)
      + kubernetes_version      = (known after apply)
      + location                = "southeastasia"
      + name                    = "demo-k8s"
      + node_resource_group     = (known after apply)
      + private_cluster_enabled = (known after apply)
      + private_fqdn            = (known after apply)
      + private_link_enabled    = (known after apply)
      + resource_group_name     = "demo-k8s-rg"
      + sku_tier                = "Free"

      + addon_profile {
          + aci_connector_linux {
              + enabled = false
            }

          + azure_policy {
              + enabled = true
            }

          + http_application_routing {
              + enabled                            = false
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = true
            }

          + oms_agent {
              + enabled                    = true
              + log_analytics_workspace_id = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/microsoft.operationalinsights/workspaces/demo-k8s-monitor"
              + oms_agent_identity         = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
        }

      + default_node_pool {
          + availability_zones   = [
              + "1",
              + "2",
              + "3",
            ]
          + enable_auto_scaling  = true
          + max_count            = 3
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "system"
          + node_count           = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + vm_size              = "Standard_D2s_v4"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "standard"
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true

          + azure_active_directory {
              + admin_group_object_ids = [
                  + "f453d3b2-44fe-4359-83cc-1328bcf53d27",
                ]
              + managed                = true
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster_node_pool.k8s_nodepool_dev will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "k8s_nodepool_dev" {
      + availability_zones    = [
          + "1",
          + "2",
          + "3",
        ]
      + enable_auto_scaling   = true
      + eviction_policy       = "Delete"
      + id                    = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 3
      + max_pods              = (known after apply)
      + min_count             = 1
      + mode                  = "User"
      + name                  = "dev"
      + node_count            = (known after apply)
      + node_labels           = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
        }
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_type               = "Linux"
      + priority              = "Spot"
      + spot_max_price        = -1
      + tags                  = {
          + "Environment" = "Dev"
        }
      + vm_size               = "Standard_B2ms"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + host        = (known after apply)
  + id          = (known after apply)
  + kube_config = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```
</details>s
*Pusher: @SatyKrish, Action: `pull_request`*